
  ## Terraform Plan Results for `prod`
  
  <details>
  <summary>Show Plan</summary>
  
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.aws_load_balancer_controller[0] will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.6.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "eks-infrastructure-prod-eks"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "eu-west-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.cluster_autoscaler[0] will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.29.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "eks-infrastructure-prod-eks"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "awsRegion"
          + value = "eu-west-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-delay-after-add"
          + value = "10m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-unneeded-time"
          + value = "10m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.aws_cloudwatch_log_group.cluster[0] will be created
  + resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/eks-infrastructure-prod-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "AutoScale"   = "Enabled"
          + "Backup"      = "Critical"
          + "Compliance"  = "Required"
          + "CostCenter"  = "Engineering"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Monitoring"  = "24x7"
          + "Name"        = "eks-infrastructure-prod-eks-logs"
          + "Owner"       = "DevOps Team"
          + "Project"     = "eks-infrastructure"
          + "Purpose"     = "Production"
          + "Team"        = "DevOps"
        }
      + tags_all          = {
          + "AutoScale"   = "Enabled"
          + "Backup"      = "Critical"
          + "Compliance"  = "Required"
          + "CostCenter"  = "Engineering"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Monitoring"  = "24x7"
          + "Name"        = "eks-infrastructure-prod-eks-logs"
          + "Owner"       = "DevOps Team"
          + "Project"     = "eks-infrastructure"
          + "Purpose"     = "Production"
          + "Team"        = "DevOps"
        }
    }

  # module.eks.aws_eks_addon.addons["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "addons" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.25.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-infrastructure-prod-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags                        = {
          + "AutoScale"   = "Enabled"
          + "Backup"      = "Critical"
          + "Compliance"  = "Required"
          + "CostCenter"  = "Engineering"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Monitoring"  = "24x7"
          + "Name"        = "eks-infrastructure-prod-eks-aws-ebs-csi-driver"
          + "Owner"       = "DevOps Team"
          + "Project"     = "eks-infrastructure"
          + "Purpose"     = "Production"
          + "Team"        = "DevOps"
        }
      + tags_all                    = {
          + "AutoScale"   = "Enabled"
          + "Backup"      = "Critical"
          + "Compliance"  = "Required"
          + "CostCenter"  = "Engineering"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Monitoring"  = "24x7"
          + "Name"        = "eks-infrastructure-prod-eks-aws-ebs-csi-driver"
          + "Owner"       = "DevOps Team"
          + "Project"     = "eks-infrastructure"
          + "Purpose"     = "Production"
          + "Team"        = "DevOps"
        }
    }

  # module.eks.aws_eks_addon.addons["coredns"] will be created
  + resource "aws_eks_addon" "addons" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.1-eksbuild.4"
      + arn                         = (known after apply)
      + cluster_name                = "eks-infrastructure-prod-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "AutoScale"   = "Enabled"
          + "Backup"      = "Critical"
          + "Compliance"  = "Required"
          + "CostCenter"  = "Engineering"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Monitoring"  = "24x7"
          + "Name"        = "eks-infrastructure-prod-eks-coredns"
          + "Owner"       = "DevOps Team"
          + "Project"     = "eks-infrastructure"
          + "Purpose"     = "Production"
          + "Team"        = "DevOps"
        }
      + tags_all                    = {
          + "AutoScale"   = "Enabled"
          + "Backup"      = "Critical"
          + "Compliance"  = "Required"
          + "CostCenter"  = "Engineering"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Monitoring"  = "24x7"
          + "Name"        = "eks-infrastructure

... (truncated)
  ```
  
  </details>
  